{
    "posts": [
        {
            "id": "20240101_AIWARE",
            "title": "RESHAPE Lab paper accepted at AIware Conference 2024",
            "date": "2024-05-07",
            "tag": "PAPERS",
            "description": "<p> 🎉 Exciting News from RESHAPE Lab 🎉 </p><p> We are thrilled to share that our latest paper, 'Unveiling the Potential of a Conversational Agent in Developer Support: Insights from Mozilla’s PDF.js Project,' has been accepted for presentation at AIware Conference 2024! </p> <p> 🔍 About the Paper: Our research introduces a conversational agent designed to enhance developer interactions with software projects by integrating project-specific data. Through our study with Mozilla’s PDF.js, the agent has proven to help reduce the reliance on human mentors by providing timely and relevant information, streamlining the development process. </p> <p> 👥 Authors: </p> <ul><li>João Correia, Daniel Coutinho, Caio Barbosa & Alessandro Garcia, PUC-Rio </li><li>Morgan C. Nicholson, University of São Paulo (USP) </li> <li>Marco Castelluccio, Mozilla Corporation </li> <li>Marco Gerosa & Igor Steinmacher, Northern Arizona University </li> </ul> <p> This paper not only pushes the boundaries of AI in software engineering but also offers practical tools to improve productivity and efficiency in development workflows. </p> <p> We look forward to sharing more insights at the upcoming AIware 2024 conference in Porto de Galinhas </p> ",
            "image": "images/posts/20240101_AIWARE.jpg"
        },
        {
            "id": "20240301_USES",
            "title": "Collaboration USES/UFAM -- RESHAPE/NAU! ",
            "date": "2024-03-01",
            "person": ["igor steinmacher"],
            "tag":"COLLABORATION",
            "description": "<p>NAU will receive six Brazilian scholars as part of a project led by the Institute of Computing at the Federal University of Amazonas, that includes a partnership with the School of Informatics Computing and Cyber Systems at NAU. The proposal, titled 'Enhancing the Quality of Software Projects: Techniques for Supporting Software Development with a Focus on Process and Product Quality,' aims to develop new technologies to improve software quality. It focuses on enhancing user experience (UX) and developer experience (DX) through innovative approaches. The project will apply evidence-based methodologies for creating new approaches, focusing on conceiving inclusive technologies with a special interest in diverse populations.</p> <p>This grant was awarded by the Brazilian National Council for Scientific and Technological Development (CNPq) as part of a solicitation that focused on fostering the internationalization of Brazilian universities by strengthening their collaboration with strong groups outside of Brazil.></p><p>This project is led by Dr. Tayana Uchôa Conte, Associate Professor at the Federal University of Amazonas, in collaboration with Dr. Igor Steinmacher, Assistant Professor at SICCS. According to the plan, NAU will receive 6 scholars in an 18-month time frame, including 2 Ph.D. candidates, 2 Early Career Researchers, and 2 Senior Researchers. </p>",
            "image": "images/posts/20240301_USES.jpg"
        },
        {
            "id": "20240301_ICSE",
            "title": "RESHAPE Lab hat trick at ICSE 2024! ",
            "date": "2024-03-01",
            "person": ["bianca trinkenreich", "igor steinmacher", "marco gerosa", "joao felipe pimentel"],
            "tag":"PAPERS",
            "description": "RESHAPE Lab will be very well represented at ICSE 2024 in Lisbon! Members of our lab are co-authors of three papers in the Research Track that will be presented at the conference:<br><ul><li>'How Far Are We? The Triumphs and Trials of Generative AI in Learning Software Engineering' by Rudrajit Choudhuri, Dylan Liu, Igor Steinmacher, Marco Gerosa, Anita Sarma</li><li>'How to Support ML End-User Programmers through a Conversational Agent' by Emily Judith Arteaga Garcia, João Felipe Pimentel, Zixuan Feng, Marco Gerosa, Igor Steinmacher, Anita Sarma</li><li>'Unraveling the Drivers of Sense of Belonging in Software Delivery Teams: Insights from a Large-Scale Survey' by Bianca Trinkenreich, Marco Gerosa, Igor Steinmacher</li></ul> <br><br>Two of the papers are part of projects in collaboration with EPIC Lab from Oregon State University, and the last one is a paper with Bianca Trinkenreich in industry context. <br><br> We will be well represented in Lisbon! <br> 'Nos vemos lá!'",
            "image": "images/posts/20240301_ICSE.jpg"
        },
        {
            "id": "20240201_BIANCA_AWARD",
            "title": "Bianca Trinkenreich received the 2024 ACM SIGSOFT Distinguished Dissertation Award",
            "date": "2024-02-01",
            "person": ["bianca trinkenreich", "igor steinmacher", "marco gerosa"],
            "tag":"AWARD",
            "description": "Bianca Trinkenreich received the 2024 ACM SIGSOFT Distinguished Dissertation Award for her Ph.D. dissertation “Understanding and Supporting Women’s Participation in Open Source Software” (Northern Arizona University, supervised by Igor Steinmacher and co-supervised by Marco Aurelio Gerosa). More details: https://sigsoft.medium.com/sigsoft-awards-2024-ce34b9ee23a6",
            "image": "images/posts/20240201_bianca_award.jpg"
        }
    ]
}