{
    "projects": [
        {
            "project_name": "Diversity in Open Source Software",
            "project_key_words": [
                "Open Source Software",
                "Diversity",
                "Software",
                "Open Source Software",
                "Diversity",
                "Software",
                "Open Source Software",
                "Diversity",
                "Software"
            ],
            "project_description": "Software development is usually a collaborative venture. Open Source Software (OSS) projects are no exception; indeed, by design, the OSS approach can accommodate teams that are more open, geographically distributed, and dynamic than commercial teams. This, we find, leads to OSS teams that are quite diverse. Team diversity, predominantly in offline groups, is known to correlate with team output, mostly with positive effects. How about in OSS? Using GitHub, the largest publicly available collection of OSS projects, we studied how gender and tenure diversity relate to team productivity and turnover. Using regression modeling of GitHub data and the results of a survey, we show that both gender and tenure diversity are positive and significant predictors of productivity. These results can inform decision making on all levels, leading to better outcomes in recruiting and performance. Software development is usually a collaborative venture. Open Source Software (OSS) projects are no exception; indeed, by design, the OSS approach can accommodate teams that are more open, geographically distributed, and dynamic than commercial teams. This, we find, leads to OSS teams that are quite diverse. Team diversity, predominantly in offline groups, is known to correlate with team output, mostly with positive effects. How about in OSS? Using GitHub, the largest publicly available collection of OSS projects, we studied how gender and tenure diversity relate to team productivity and turnover. Using regression modeling of GitHub data and the results of a survey, we show that both gender and tenure diversity are positive and significant predictors of productivity. These results can inform decision making on all levels, leading to better outcomes in recruiting and performance.",
            "short_project_description": "Software development is usually a collaborative venture. Open Source Software (OSS) projects are no exception; indeed, by design, the OSS approach can accommodate teams that are more open, geographically distributed, and dynamic than commercial teams. This, we find, leads to OSS teams that are quite diverse. Team diversity, predominantly in offline groups, is known to correlate with team output, mostly with positive effects. How about in OSS?",
            "images": {
                "small_image": "reshapelab/images/projects/DiversityinOpenSourceSoftware/image_with_background.png"
            }
        },
        {
            "project_name": "Open Science",
            "project_key_words": [
                "open science",
                "open source",
                "science"
            ],
            "project_description": "Open science is the movement to make scientific research, data and dissemination accessible to all levels of an inquiring society, amateur or professional. It encompasses practices such as publishing open research, campaigning for open access, encouraging scientists to practice open notebook science, and generally making it easier to publish and communicate scientific knowledge. The European-funded project Facilitate Open Science Training for European Research (FOSTER) has developed a set of ten free online courses, or e-learning modules, to help researchers, postgraduate students, librarians and other professionals working in higher education and research to understand the concept of open science and how to put it into practice.",
            "short_project_description": "Software development is usually a collaborative venture. Open Source Software (OSS) projects are no exception; indeed, by design, the OSS approach can accommodate teams that are more open, geographically distributed, and dynamic than commercial teams. This, we find, leads to OSS teams that are quite diverse. Team diversity, predominantly in offline groups, is known to correlate with team output, mostly with positive effects. How about in OSS?",
            "images": {
                "small_image": "reshapelab/images/projects/OpenScience/image_with_background.png"
            }
        }
    ]
}